app/controllers/get_data_controller.rb

  def pull
    # joins associated tables and build json object to be sent to client
    products = Product.joins(:properties, :product_properties).map do |product|
      {
        name: product.name,
        upc: product.upc,
        available_on: product.available_on.strftime("%d/%m/%Y"),
        properties: product.product_properties.map do |product_property|
---
SELECT "products".* FROM "products" INNER JOIN "product_properties" ON "product_properties"."product_id" = "products"."id" INNER JOIN "properties" ON "properties"."id" = "product_properties"."property_id" INNER JOIN "product_properties" "product_properties_products" ON "product_properties_products"."product_id" = "products"."id"
SELECT "product_properties".* FROM "product_properties" WHERE "product_properties"."product_id" = $1  [["product_id", 2]]